#!/bin/bash

if lsof -i :80 >/dev/null 2>&1; then
    echo "###############################################################"
    echo " [Caution] 8080 포트가 이미 사용 중입니다."
    echo " HWAS or MWAS 기동중인 서버에서는 본 Simulator 사용 불가."
    echo "###############################################################"
    lsof -i :8080 
    echo "----------------------------------------------------------------"
    netstat -anp | grep 8080 
    exit 1
fi

if [ -z "$1" ]; then
    echo "#################################################################################################"
    echo " [HELP] 첫번째 인자값은 MWAS 연동시 필요한 Port 번호 입니다."
    echo " 주) UPM 서버의 t_pm_configuration의 STMP 연동 설정 정보에 IP/Port를 확인 하여 설정해 주십시요."
    echo "     반드시 STMP Simulator인 본 Simulator 기동시에는 8080 port를 사용 하고 있지 않아야 합니다." 
    echo "     HWAS or MWAS 기동중인 서버에서는 본 Simulator 사용 불가함!!!"
    echo "#################################################################################################"
    exit 1
fi

java -jar Mdms_sim.jar $1
